SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
// ═══════════════════════════════════════════════════════════════════════════
// HaleHound-CYD NRF24 Attack Modules Implementation
// FULL IMPLEMENTATIONS - Ported from ESP32-DIV v2.5 HaleHound Edition
// Created: 2026-02-06
// Updated: 2026-02-07 - Full implementation port
// ═══════════════════════════════════════════════════════════════════════════
//
// NRF24 PIN CONFIGURATION:
//   Standard CYD: CE=GPIO16, CSN=GPIO4
//   NM-RF-Hat:    CE=GPIO22, CSN=GPIO27 (shared with CC1101 via hat switch)
//   SCK = GPIO18 (shared SPI)
//   MOSI = GPIO23 (shared SPI)
//   MISO = GPIO19 (shared SPI)
//   VCC = 3.3V (add 10uF capacitor!)
//
// ═══════════════════════════════════════════════════════════════════════════

#include "nrf24_attacks.h"
#include "nrf24_config.h"
#include "shared.h"
#include "touch_buttons.h"
#include "utils.h"
#include "icon.h"
#include <SPI.h>

// Free Fonts are already included via TFT_eSPI when LOAD_GFXFF is enabled
// Available: FreeMonoBold9pt7b, FreeMonoBold12pt7b, FreeMonoBold18pt7b, etc.

// ═══════════════════════════════════════════════════════════════════════════
// NRF24 PIN DEFINITIONS — from cyd_config.h (respects NMRF_HAT)
// ═══════════════════════════════════════════════════════════════════════════

#define NRF_CE   NRF24_CE
#define NRF_CSN  NRF24_CSN

// Use default SPI object (VSPI) - shared with SD card, separate CS pins

// NRF24 Register Definitions
#define _NRF24_CONFIG      0x00
#define _NRF24_EN_AA       0x01
#define _NRF24_EN_RXADDR   0x02
#define _NRF24_SETUP_AW    0x03
#define _NRF24_RF_CH       0x05
#define _NRF24_RF_SETUP    0x06
#define _NRF24_STATUS      0x07
#define _NRF24_RPD         0x09
#define _NRF24_RX_ADDR_P0  0x0A
#define _NRF24_RX_ADDR_P1  0x0B
#define _NRF24_RX_ADDR_P2  0x0C
#define _NRF24_RX_ADDR_P3  0x0D
#define _NRF24_RX_ADDR_P4  0x0E
#define _NRF24_RX_ADDR_P5  0x0F

// Promiscuous mode noise-catching addresses (alternating bit patterns)
static const uint8_t noiseAddr0[] = {0x55, 0x55};
static const uint8_t noiseAddr1[] = {0xAA, 0xAA};
static const uint8_t noiseAddr2 = 0xA0;
static const uint8_t noiseAddr3 = 0xAB;
static const uint8_t noiseAddr4 = 0xAC;
static const uint8_t noiseAddr5 = 0xAD;

// ═══════════════════════════════════════════════════════════════════════════
// SHARED ICON BAR FOR NRF24 SCREENS
// ═══════════════════════════════════════════════════════════════════════════

#define NRF_ICON_SIZE 16
#define NRF_ICON_NUM 3

static int nrfIconX[NRF_ICON_NUM] = {SCALE_X(170), SCALE_X(210), 10};
static const unsigned char* nrfIcons[NRF_ICON_NUM] = {
    bitmap_icon_undo,      // Calibrate/Reset
    bitmap_icon_start,     // Start/Stop
    bitmap_icon_go_back    // Back
};

static int nrfActiveIcon = -1;
static int nrfAnimState = 0;
static unsigned long nrfLastAnim = 0;

// Draw icon bar with 3 icons - MATCHES ORIGINAL HALEHOUND
static void drawNrfIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < NRF_ICON_NUM; i++) {
        if (nrfIcons[i] != NULL) {
            tft.drawBitmap(nrfIconX[i], ICON_BAR_Y, nrfIcons[i], NRF_ICON_SIZE, NRF_ICON_SIZE, HALEHOUND_MAGENTA);
        }
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

// Check icon bar touch and return icon index (0-2) or -1
static int checkNrfIconTouch() {
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            for (int i = 0; i < NRF_ICON_NUM; i++) {
                if (tx >= nrfIconX[i] - 5 && tx <= nrfIconX[i] + NRF_ICON_SIZE + 5) {
                    if (nrfAnimState == 0) {
                        tft.drawBitmap(nrfIconX[i], ICON_BAR_Y, nrfIcons[i], NRF_ICON_SIZE, NRF_ICON_SIZE, TFT_BLACK);
                        nrfAnimState = 1;
                        nrfActiveIcon = i;
                        nrfLastAnim = millis();
                    }
                    return i;
                }
            }
        }
    }
    return -1;
}

// Process icon animation and return action (0=calibrate, 1=scan, 2=back, -1=none)
static int processNrfIconAnim() {
    if (nrfAnimState > 0 && millis() - nrfLastAnim >= 50) {
        if (nrfAnimState == 1) {
            tft.drawBitmap(nrfIconX[nrfActiveIcon], ICON_BAR_Y, nrfIcons[nrfActiveIcon], NRF_ICON_SIZE, NRF_ICON_SIZE, HALEHOUND_MAGENTA);
            nrfAnimState = 2;
            int action = nrfActiveIcon;
            nrfLastAnim = millis();
            return action;
        } else if (nrfAnimState == 2) {
            nrfAnimState = 0;
            nrfActiveIcon = -1;
        }
    }
    return -1;
}

// ═══════════════════════════════════════════════════════════════════════════
// SHARED NRF24 SPI FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

static byte nrfGetRegister(byte r) {
    byte c;
    digitalWrite(NRF_CSN, LOW);
    SPI.transfer(r & 0x1F);
    c = SPI.transfer(0);
    digitalWrite(NRF_CSN, HIGH);
    return c;
}

static void nrfSetRegister(byte r, byte v) {
    digitalWrite(NRF_CSN, LOW);
    SPI.transfer((r & 0x1F) | 0x20);
    SPI.transfer(v);
    digitalWrite(NRF_CSN, HIGH);
}

static void nrfSetRegisterMulti(byte r, const byte* data, byte len) {
    digitalWrite(NRF_CSN, LOW);
    SPI.transfer((r & 0x1F) | 0x20);
    for (byte i = 0; i < len; i++) {
        SPI.transfer(data[i]);
    }
    digitalWrite(NRF_CSN, HIGH);
}

static void nrfSetChannel(uint8_t channel) {
    nrfSetRegister(_NRF24_RF_CH, channel);
}

static void nrfPowerUp() {
    nrfSetRegister(_NRF24_CONFIG, nrfGetRegister(_NRF24_CONFIG) | 0x02);
    delayMicroseconds(130);
}

static void nrfPowerDown() {
    nrfSetRegister(_NRF24_CONFIG, nrfGetRegister(_NRF24_CONFIG) & ~0x02);
}

static void nrfEnable() {
    digitalWrite(NRF_CE, HIGH);
}

static void nrfDisable() {
    digitalWrite(NRF_CE, LOW);
}

static void nrfSetRX() {
    nrfSetRegister(_NRF24_CONFIG, nrfGetRegister(_NRF24_CONFIG) | 0x01);
    nrfEnable();
    delayMicroseconds(100);
}

static void nrfSetTX() {
    // PWR_UP=1, PRIM_RX=0 for TX mode
    nrfSetRegister(_NRF24_CONFIG, (nrfGetRegister(_NRF24_CONFIG) | 0x02) & ~0x01);
    delayMicroseconds(150);
}

static bool nrfCarrierDetected() {
    return nrfGetRegister(_NRF24_RPD) & 0x01;
}

