SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
// Initialize NRF24 hardware
static bool nrfInit() {
    // Configure NRF24 pins
    pinMode(NRF_CE, OUTPUT);
    pinMode(NRF_CSN, OUTPUT);
    digitalWrite(NRF_CE, LOW);
    digitalWrite(NRF_CSN, HIGH);

    // ALWAYS deselect other SPI devices (CS HIGH) before NRF24 operations
    #ifndef NMRF_HAT
    // Standard CYD: CC1101 CS (GPIO 27) is separate from NRF24 CSN (GPIO 4)
    pinMode(CC1101_CS, OUTPUT);
    digitalWrite(CC1101_CS, HIGH);  // Deselect CC1101
    #endif
    // Hat: CC1101_CS == NRF24_CSN == GPIO 27 — already deselected above via NRF_CSN
    pinMode(SD_CS, OUTPUT);
    digitalWrite(SD_CS, HIGH);   // Deselect SD card

    // Reset SPI bus with proper settle time between end/begin
    SPI.end();
    delay(10);
    SPI.begin(18, 19, 23);  // NO CS pin - manual control with digitalWrite
    SPI.setDataMode(SPI_MODE0);
    SPI.setFrequency(4000000);  // 4MHz — conservative for reliable detection
    SPI.setBitOrder(MSBFIRST);
    delay(10);

    // Try up to 3 times with increasing delays — some boards need longer settle
    bool found = false;
    for (int attempt = 0; attempt < 3; attempt++) {
        if (attempt > 0) delay(attempt * 100);  // 0ms, 100ms, 200ms

        nrfDisable();
        nrfPowerUp();
        nrfSetRegister(_NRF24_EN_AA, 0x00);       // Disable auto-ack
        nrfSetRegister(_NRF24_RF_SETUP, 0x0F);    // 2Mbps, max power

        byte status = nrfGetRegister(_NRF24_STATUS);
        if (status != 0x00 && status != 0xFF) {
            found = true;
            // Bump to full speed now that we know the chip is alive
            SPI.setFrequency(8000000);
            break;
        }
    }

    return found;
}

// ═══════════════════════════════════════════════════════════════════════════
// SCANNER - 2.4GHz Channel Scanner with Bar Graph
// WiFi-only scanning range: 2400-2484 MHz = NRF channels 0-84
// ═══════════════════════════════════════════════════════════════════════════

namespace Scanner {

// WiFi-only scanning range
#define SCAN_CHANNELS 85          // 0-84 = 85 channels (2400-2484 MHz)

// Bar graph layout
#define BAR_START_X 10
#define BAR_START_Y CONTENT_Y_START + 4
#define BAR_WIDTH CONTENT_INNER_W
#define BAR_HEIGHT SCALE_Y(210)

// WiFi channel positions (NRF24 channel numbers)
#define WIFI_CH1_NRF 12
#define WIFI_CH6_NRF 37
#define WIFI_CH11_NRF 62
#define WIFI_CH13_NRF 72

// Data arrays
static uint8_t bar_peak_levels[SCAN_CHANNELS];
static int backgroundNoise[SCAN_CHANNELS] = {0};
static bool noiseCalibrated = false;
static bool scanner_initialized = false;
static bool scanning = true;
static bool exitRequested = false;
static bool uiDrawn = false;

// Skull signal meter icons and animation
static const unsigned char* scannerSkulls[] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};
static const int numScannerSkulls = 8;
static int scannerSkullFrame = 0;

// Get bar color (teal to hot pink gradient)
static uint16_t getBarColor(int height, int maxHeight) {
    float ratio = (float)height / (float)maxHeight;
    if (ratio > 1.0f) ratio = 1.0f;

    // Teal RGB(0, 207, 255) -> Hot Pink RGB(255, 28, 82)
    uint8_t r = 0 + (uint8_t)(ratio * 255);
    uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
    uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));

    return tft.color565(r, g, b);
}

static void clearBarGraph() {
    memset(bar_peak_levels, 0, sizeof(bar_peak_levels));
}

static void drawScannerFrame() {
    // Y-axis line
    tft.drawFastVLine(BAR_START_X - 2, BAR_START_Y, BAR_HEIGHT, HALEHOUND_MAGENTA);

    // X-axis line
    tft.drawFastHLine(BAR_START_X, BAR_START_Y + BAR_HEIGHT, BAR_WIDTH, HALEHOUND_MAGENTA);

    // WiFi channel markers - vertical dashed lines
    int x1 = BAR_START_X + (WIFI_CH1_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x6 = BAR_START_X + (WIFI_CH6_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x11 = BAR_START_X + (WIFI_CH11_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x13 = BAR_START_X + (WIFI_CH13_NRF * BAR_WIDTH / SCAN_CHANNELS);

    for (int y = BAR_START_Y; y < BAR_START_Y + BAR_HEIGHT; y += 6) {
        tft.drawPixel(x1, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x6, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x11, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x13, y, HALEHOUND_VIOLET);
    }

    // Channel labels
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(x1 - 2, BAR_START_Y - 10);
    tft.print("1");
    tft.setCursor(x6 - 2, BAR_START_Y - 10);
    tft.print("6");
    tft.setCursor(x11 - 6, BAR_START_Y - 10);
    tft.print("11");
    tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(x13 - 6, BAR_START_Y - 10);
    tft.print("13");

    // Frequency labels
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(BAR_START_X - 5, BAR_START_Y + BAR_HEIGHT + 4);
    tft.print("2400");
    tft.setCursor(BAR_START_X + BAR_WIDTH/2 - 12, BAR_START_Y + BAR_HEIGHT + 4);
    tft.print("2442");
    tft.setCursor(BAR_START_X + BAR_WIDTH - 28, BAR_START_Y + BAR_HEIGHT + 4);
    tft.print("2484");

    // Divider
    tft.drawFastHLine(0, BAR_START_Y + BAR_HEIGHT + 16, SCREEN_WIDTH, HALEHOUND_HOTPINK);
}

static void drawBarGraph() {
    // Clear bar area
    tft.fillRect(BAR_START_X, BAR_START_Y, BAR_WIDTH, BAR_HEIGHT, TFT_BLACK);

    // Redraw WiFi channel markers
    int x1 = BAR_START_X + (WIFI_CH1_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x6 = BAR_START_X + (WIFI_CH6_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x11 = BAR_START_X + (WIFI_CH11_NRF * BAR_WIDTH / SCAN_CHANNELS);
    int x13 = BAR_START_X + (WIFI_CH13_NRF * BAR_WIDTH / SCAN_CHANNELS);

    for (int y = BAR_START_Y; y < BAR_START_Y + BAR_HEIGHT; y += 6) {
        tft.drawPixel(x1, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x6, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x11, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x13, y, HALEHOUND_VIOLET);
    }

