SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
    // Track peak
    int peakChannel = 0;
    uint8_t peakLevel = 0;

    // Draw bars
    for (int ch = 0; ch < SCAN_CHANNELS; ch++) {
        uint8_t level = bar_peak_levels[ch];

        if (level > peakLevel) {
            peakLevel = level;
            peakChannel = ch;
        }

        if (level > 0) {
            int x = BAR_START_X + (ch * BAR_WIDTH / SCAN_CHANNELS);
            int barH = (level * BAR_HEIGHT) / 125;
            if (barH > BAR_HEIGHT) barH = BAR_HEIGHT;
            if (barH < 4 && level > 0) barH = 4;

            int barY = BAR_START_Y + BAR_HEIGHT - barH;

            // Gradient bar
            for (int y = 0; y < barH; y++) {
                uint16_t color = getBarColor(y, BAR_HEIGHT);
                tft.drawFastHLine(x, barY + barH - 1 - y, 2, color);
            }
        }
    }

    // Status area - compact layout below graph
    int statusY = BAR_START_Y + BAR_HEIGHT + 6;
    tft.fillRect(0, statusY, SCREEN_WIDTH, SCREEN_HEIGHT - statusY, TFT_BLACK);

    // Divider line
    tft.drawFastHLine(0, statusY - 2, SCREEN_WIDTH, HALEHOUND_HOTPINK);

    // Peak frequency - compact above skulls
    int peakFreq = 2400 + peakChannel;
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(SCALE_X(85), statusY + 2);
    tft.print("PEAK: ");
    tft.setTextColor(HALEHOUND_BRIGHT, TFT_BLACK);
    tft.print(peakFreq);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.print(" MHz");

    // Skull signal meter - row of 8 skulls
    int skullY = statusY + 14;
    int skullStartX = 10;
    int skullSpacing = SCALE_X(28);  // 16px icon + scaled gap

    // How many skulls to light based on signal (0-8)
    int litSkulls = (peakLevel * 8) / 4;
    if (litSkulls > 8) litSkulls = 8;

    for (int i = 0; i < numScannerSkulls; i++) {
        int x = skullStartX + (i * skullSpacing);
        tft.fillRect(x, skullY, 16, 16, HALEHOUND_BLACK);

        if (i < litSkulls && peakLevel > 0) {
            // Animated color wave - teal to pink
            int phase = (scannerSkullFrame + i) % 8;
            uint16_t skullColor;
            if (phase < 4) {
                float ratio = phase / 3.0f;
                uint8_t r = (uint8_t)(ratio * 255);
                uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
                uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
                skullColor = tft.color565(r, g, b);
            } else {
                float ratio = (phase - 4) / 3.0f;
                uint8_t r = 255 - (uint8_t)(ratio * 255);
                uint8_t g = 28 + (uint8_t)(ratio * (207 - 28));
                uint8_t b = 82 + (uint8_t)(ratio * (255 - 82));
                skullColor = tft.color565(r, g, b);
            }
            tft.drawBitmap(x, skullY, scannerSkulls[i], 16, 16, skullColor);
        } else {
            // Unlit skull - gray
            tft.drawBitmap(x, skullY, scannerSkulls[i], 16, 16, HALEHOUND_GUNMETAL);
        }
    }
    scannerSkullFrame++;

    // Percentage at end
    int pct = (peakLevel * 100) / 125;
    if (pct > 100) pct = 100;
    tft.setTextColor(HALEHOUND_BRIGHT, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(skullStartX + (numScannerSkulls * skullSpacing) + 2, skullY + 4);
    tft.printf("%d%%", pct);
}

static void calibrateBackgroundNoise() {
    tft.fillRect(10, BAR_START_Y + BAR_HEIGHT + 40, CONTENT_INNER_W, 20, TFT_BLACK);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(10, BAR_START_Y + BAR_HEIGHT + 40);
    tft.print("Calibrating noise floor...");

    memset(backgroundNoise, 0, sizeof(backgroundNoise));

    int samples = 5;
    for (int s = 0; s < samples; s++) {
        nrfDisable();
        for (int cycles = 0; cycles < 35; cycles++) {
            for (int i = 0; i < SCAN_CHANNELS; i++) {
                nrfSetChannel(i);
                nrfSetRX();  // MUST set PRIM_RX bit to actually receive!
                delayMicroseconds(50);
                nrfDisable();
                if (nrfCarrierDetected()) {
                    backgroundNoise[i]++;
                }
            }
        }
    }

    for (int i = 0; i < SCAN_CHANNELS; i++) {
        backgroundNoise[i] /= samples;
    }

    noiseCalibrated = true;

    tft.fillRect(10, BAR_START_Y + BAR_HEIGHT + 40, CONTENT_INNER_W, 20, TFT_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, BAR_START_Y + BAR_HEIGHT + 40);
    tft.print("Noise floor captured!");
}

static void scanDisplay() {
    // Persistent channel values (0-125 range) - NOT reset each frame
    static uint8_t channel[SCAN_CHANNELS] = {0};

    if (!scanner_initialized) {
        clearBarGraph();
        drawScannerFrame();
        memset(channel, 0, sizeof(channel));  // Only reset on init
        scanner_initialized = true;
    }

    // Single pass scan with exponential smoothing
    for (int i = 0; i < SCAN_CHANNELS && scanning && !exitRequested; ++i) {
        nrfSetChannel(i);
        nrfSetRX();  // MUST set PRIM_RX bit to actually receive! (not just CE high)
        delayMicroseconds(50);
        nrfDisable();

        int rpd = nrfCarrierDetected() ? 1 : 0;
        // Exponential smoothing: 50% old value + 50% new (scaled to 125)
        channel[i] = (channel[i] + rpd * 125) / 2;
    }

    // Check touch for exit
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty) && tx < 40 && ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
        exitRequested = true;
    }

    if (scanning) {
        // Copy smoothed values to display array
        for (int i = 0; i < SCAN_CHANNELS; i++) {
            bar_peak_levels[i] = channel[i];
        }

        drawBarGraph();
    }
}

void scannerSetup() {
    exitRequested = false;
    scanning = true;
    uiDrawn = false;
    scanner_initialized = false;
    nrfAnimState = 0;
    nrfActiveIcon = -1;

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();

    // Title
    tft.fillRect(0, ICON_BAR_Y, SCALE_X(160), ICON_BAR_H, HALEHOUND_GUNMETAL);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setTextSize(1);
    tft.setCursor(SCALE_X(35), ICON_BAR_Y + 4);
    tft.print("2.4GHz Scanner");

    drawNrfIconBar();

    // Initialize NRF24
    if (!nrfInit()) {
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setTextSize(2);
        drawCenteredText(100, "NRF24 NOT FOUND", HALEHOUND_HOTPINK, 2);
        tft.setTextSize(1);
        drawCenteredText(130, "Check wiring:", HALEHOUND_MAGENTA, 1);
        drawCenteredText(145, ("CE=GPIO" + String(NRF24_CE) + " CSN=GPIO" + String(NRF24_CSN)).c_str(), HALEHOUND_MAGENTA, 1);
        drawCenteredText(160, "Add 10uF cap on VCC!", HALEHOUND_VIOLET, 1);
        return;
    }

    clearBarGraph();
    noiseCalibrated = false;

    #if CYD_DEBUG
    Serial.println("[SCANNER] NRF24 initialized successfully");
    #endif

