SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
    scanDisplay();
    uiDrawn = true;
}

void scannerLoop() {
    // Touch uses software bit-banged SPI - no conflict with NRF24 on hardware VSPI

    if (!uiDrawn) {
        touchButtonsUpdate();
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty) || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
        }
        return;
    }

    touchButtonsUpdate();

    // Direct touch check - no animation delay
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            // Back icon (x=10)
            if (tx < 40) {
                exitRequested = true;
                return;
            }
            // Calibrate icon
            if (tx >= nrfIconX[0] - 10 && tx < nrfIconX[0] + NRF_ICON_SIZE + 10) {
                calibrateBackgroundNoise();
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                // Full reset after calibration - reinit NRF24 and force redraw
                nrfInit();
                scanner_initialized = false;
                scanning = true;
                exitRequested = false;
                clearBarGraph();
                tft.fillRect(BAR_START_X, BAR_START_Y, BAR_WIDTH, BAR_HEIGHT, TFT_BLACK);
                drawScannerFrame();
                return;  // Exit this loop iteration cleanly
            }
            // Refresh icon
            if (tx >= nrfIconX[1] - 10) {
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                // Full reset - same as calibration
                nrfInit();
                scanner_initialized = false;
                scanning = true;
                exitRequested = false;
                clearBarGraph();
                tft.fillRect(BAR_START_X, BAR_START_Y, BAR_WIDTH, BAR_HEIGHT, TFT_BLACK);
                drawScannerFrame();
                return;
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        exitRequested = true;
        return;
    }

    scanDisplay();
    delay(5);
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    scanning = false;
    exitRequested = false;
    scanner_initialized = false;
    uiDrawn = false;
    nrfPowerDown();
}

}  // namespace Scanner


// ═══════════════════════════════════════════════════════════════════════════
// ANALYZER - Spectrum Analyzer with Waterfall Display
// ═══════════════════════════════════════════════════════════════════════════

namespace Analyzer {

#define ANA_CHANNELS 85   // Same as scanner - WiFi band 2400-2484 MHz

// Display layout - FULL SCREEN (scaled for 2.8" and 3.5")
#define GRAPH_X 2
#define GRAPH_Y (CONTENT_Y_START + 4)
#define GRAPH_WIDTH GRAPH_FULL_W
#define GRAPH_HEIGHT SCALE_Y(115)

#define WATERFALL_Y (GRAPH_Y + GRAPH_HEIGHT + SCALE_Y(5))
#define WATERFALL_HEIGHT SCALE_Y(126)  // 7 rows × scaled spacing

// Skull waterfall grid
#define SKULL_SIZE 16
#define SKULL_COLS (GRAPH_FULL_W / 17)  // Scale columns to available width
#define SKULL_ROWS 7                    // 7 rows of skulls
#define SKULL_SPACING_X (GRAPH_FULL_W / SKULL_COLS)  // Evenly spaced
#define SKULL_SPACING_Y (WATERFALL_HEIGHT / SKULL_ROWS)

// WiFi channel positions
#define WIFI_CH1 12
#define WIFI_CH6 37
#define WIFI_CH11 62
#define WIFI_CH13 72

// Data arrays
static uint8_t current_levels[ANA_CHANNELS];
static uint8_t peak_levels[ANA_CHANNELS];
static uint8_t skull_waterfall[SKULL_ROWS][SKULL_COLS];  // Skull-based waterfall
static bool waterfall_initialized = false;
static bool analyzerRunning = true;
static bool exitRequested = false;
static unsigned long lastSkullTime = 0;
static int skullAnimFrame = 0;

// Skull types for waterfall - cycle through all 8
static const unsigned char* skullTypes[] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};
static const int numSkullTypes = 8;

// Skull waterfall color - hot pink (strong) -> electric blue (weak) -> dark gray (none)
static uint16_t getSkullColor(uint8_t level) {
    if (level == 0) return HALEHOUND_GUNMETAL;  // No signal = dark gray

    // BOOST sensitivity - multiply level by 2 for subtle gradient
    int boosted = level * 2;
    if (boosted > 125) boosted = 125;

    float ratio = (float)boosted / 125.0f;

    // Electric Blue RGB(0, 207, 255) -> Hot Pink RGB(255, 28, 82)
    uint8_t r = (uint8_t)(ratio * 255);
    uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
    uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));

    return tft.color565(r, g, b);
}

static void clearSkullWaterfall() {
    memset(skull_waterfall, 0, sizeof(skull_waterfall));
}

static void updateSkullWaterfall() {
    // Shift all rows down by one
    for (int row = SKULL_ROWS - 1; row > 0; row--) {
        for (int col = 0; col < SKULL_COLS; col++) {
            skull_waterfall[row][col] = skull_waterfall[row - 1][col];
        }
    }

    // Average channels into skull columns for top row
    int channelsPerSkull = ANA_CHANNELS / SKULL_COLS;  // 85 / 14 = 6 channels per skull

    for (int col = 0; col < SKULL_COLS; col++) {
        int startCh = col * channelsPerSkull;
        int endCh = startCh + channelsPerSkull;
        if (col == SKULL_COLS - 1) endCh = ANA_CHANNELS;  // Last skull gets remaining

        // Find max signal in this range (more responsive than average)
        uint8_t maxLevel = 0;
        for (int ch = startCh; ch < endCh; ch++) {
            if (peak_levels[ch] > maxLevel) {
                maxLevel = peak_levels[ch];
            }
        }
        skull_waterfall[0][col] = maxLevel;
    }
}

static void drawSkullWaterfall() {
    // Clear waterfall area
    tft.fillRect(GRAPH_X, WATERFALL_Y, GRAPH_WIDTH, WATERFALL_HEIGHT, TFT_BLACK);

    // Draw skull grid with wave animation
    for (int row = 0; row < SKULL_ROWS; row++) {
        int y = WATERFALL_Y + (row * SKULL_SPACING_Y);

        for (int col = 0; col < SKULL_COLS; col++) {
            int x = GRAPH_X + (col * SKULL_SPACING_X);
            uint8_t level = skull_waterfall[row][col];

