SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
            uint16_t color;
            if (level == 0) {
                color = HALEHOUND_GUNMETAL;  // No signal = dark gray
            } else {
                // Apply fade based on row (older = dimmer)
                float rowFade = 1.0f - (row * 0.12f);

                // Wave animation phase - creates pulsing color wave
                int phase = (skullAnimFrame + col + row) % 8;
                float waveBoost = (phase < 4) ? (phase / 4.0f) : ((8 - phase) / 4.0f);

                // Combine signal level with wave animation
                float signalRatio = (float)(level * 2) / 125.0f;
                if (signalRatio > 1.0f) signalRatio = 1.0f;

                // Blend: signal determines base, wave adds shimmer
                float finalRatio = (signalRatio * 0.7f) + (waveBoost * 0.3f);
                finalRatio *= rowFade;
                if (finalRatio > 1.0f) finalRatio = 1.0f;

                // Electric Blue RGB(0, 207, 255) -> Hot Pink RGB(255, 28, 82)
                uint8_t r = (uint8_t)(finalRatio * 255);
                uint8_t g = 207 - (uint8_t)(finalRatio * (207 - 28));
                uint8_t b = 255 - (uint8_t)(finalRatio * (255 - 82));
                color = tft.color565(r, g, b);
            }

            // Cycle through all 8 skull types left to right
            const unsigned char* skullIcon = skullTypes[col % numSkullTypes];
            tft.drawBitmap(x, y, skullIcon, SKULL_SIZE, SKULL_SIZE, color);
        }
    }
    skullAnimFrame++;  // Advance animation
}

static void drawWiFiMarkers() {
    int x1 = GRAPH_X + (WIFI_CH1 * GRAPH_WIDTH / ANA_CHANNELS);
    int x6 = GRAPH_X + (WIFI_CH6 * GRAPH_WIDTH / ANA_CHANNELS);
    int x11 = GRAPH_X + (WIFI_CH11 * GRAPH_WIDTH / ANA_CHANNELS);
    int x13 = GRAPH_X + (WIFI_CH13 * GRAPH_WIDTH / ANA_CHANNELS);

    for (int y = GRAPH_Y; y < GRAPH_Y + GRAPH_HEIGHT; y += 4) {
        tft.drawPixel(x1, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x6, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x11, y, HALEHOUND_HOTPINK);
        tft.drawPixel(x13, y, HALEHOUND_VIOLET);
    }

    // Labels
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(x1 - 4, GRAPH_Y - 10);
    tft.print("1");
    tft.setCursor(x6 - 4, GRAPH_Y - 10);
    tft.print("6");
    tft.setCursor(x11 - 8, GRAPH_Y - 10);
    tft.print("11");
    tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(x13 - 8, GRAPH_Y - 10);
    tft.print("13");
}

static void drawAxes() {
    tft.drawLine(GRAPH_X - 2, GRAPH_Y, GRAPH_X - 2, GRAPH_Y + GRAPH_HEIGHT, HALEHOUND_MAGENTA);
    tft.drawLine(GRAPH_X, GRAPH_Y + GRAPH_HEIGHT, GRAPH_X + GRAPH_WIDTH, GRAPH_Y + GRAPH_HEIGHT, HALEHOUND_MAGENTA);

    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(GRAPH_X - 5, GRAPH_Y + GRAPH_HEIGHT + 3);
    tft.print("2400");
    tft.setCursor(GRAPH_X + GRAPH_WIDTH/2 - 15, GRAPH_Y + GRAPH_HEIGHT + 3);
    tft.print("2442");
    tft.setCursor(GRAPH_X + GRAPH_WIDTH - 25, GRAPH_Y + GRAPH_HEIGHT + 3);
    tft.print("2484");

    tft.drawLine(0, WATERFALL_Y - 2, SCREEN_WIDTH, WATERFALL_Y - 2, HALEHOUND_HOTPINK);
}

// Get bar color - matches Scanner style (teal to hot pink gradient)
static uint16_t getAnalyzerBarColor(int height, int maxHeight) {
    float ratio = (float)height / (float)maxHeight;
    if (ratio > 1.0f) ratio = 1.0f;

    // Teal RGB(0, 207, 255) -> Hot Pink RGB(255, 28, 82)
    uint8_t r = 0 + (uint8_t)(ratio * 255);
    uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
    uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));

    return tft.color565(r, g, b);
}

static void drawSpectrum() {
    tft.fillRect(GRAPH_X, GRAPH_Y, GRAPH_WIDTH, GRAPH_HEIGHT, TFT_BLACK);
    drawWiFiMarkers();

    for (int i = 0; i < ANA_CHANNELS; i++) {
        int x = GRAPH_X + (i * GRAPH_WIDTH / ANA_CHANNELS);

        // Use peak_levels for sticky bars - SAME SCALING AS SCANNER
        int barH = (peak_levels[i] * GRAPH_HEIGHT) / 125;
        if (barH > GRAPH_HEIGHT) barH = GRAPH_HEIGHT;
        if (barH < 4 && peak_levels[i] > 0) barH = 4;

        if (barH > 0) {
            int barY = GRAPH_Y + GRAPH_HEIGHT - barH;

            // Gradient bar - MATCHES SCANNER STYLE
            for (int y = 0; y < barH; y++) {
                uint16_t color = getAnalyzerBarColor(y, GRAPH_HEIGHT);
                tft.drawFastHLine(x, barY + barH - 1 - y, 2, color);
            }
        }
    }
    // Skulls drawn separately in loop for performance
}

static void scanAllChannels() {
    // Persistent channel values - same smoothing as Scanner
    static uint8_t channel[ANA_CHANNELS] = {0};

    // Single pass scan with exponential smoothing - MATCHES SCANNER
    for (int ch = 0; ch < ANA_CHANNELS && analyzerRunning && !exitRequested; ch++) {
        nrfSetChannel(ch);
        nrfSetRX();
        delayMicroseconds(50);
        nrfDisable();

        int rpd = nrfCarrierDetected() ? 1 : 0;
        // Exponential smoothing: 50% old + 50% new (scaled to 125) - SAME AS SCANNER
        channel[ch] = (channel[ch] + rpd * 125) / 2;
    }

    // Check touch for exit
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty) && tx < 40 && ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
        exitRequested = true;
    }

    // Copy smoothed values to peak_levels for display
    for (int i = 0; i < ANA_CHANNELS; i++) {
        peak_levels[i] = channel[i];
    }
}

static void resetPeaks() {
    memset(peak_levels, 0, sizeof(peak_levels));
    clearSkullWaterfall();
}

static void drawStatusArea() {
    int statusY = WATERFALL_Y + WATERFALL_HEIGHT + 4;
    tft.fillRect(0, statusY, SCREEN_WIDTH, 20, TFT_BLACK);

    int peakCh = 0;
    uint8_t peakVal = 0;
    for (int i = 0; i < ANA_CHANNELS; i++) {
        if (current_levels[i] > peakVal) {
            peakVal = current_levels[i];
            peakCh = i;
        }
    }

    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(5, statusY + 5);
    tft.printf("Peak:%dMHz Lv:%d", 2400 + peakCh, peakVal);
}

