SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
void analyzerSetup() {
    exitRequested = false;
    analyzerRunning = true;
    nrfAnimState = 0;
    nrfActiveIcon = -1;

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();

    // Title
    tft.fillRect(0, ICON_BAR_Y, SCALE_X(200), ICON_BAR_H, HALEHOUND_GUNMETAL);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setTextSize(1);
    tft.setCursor(SCALE_X(25), ICON_BAR_Y + 4);
    tft.print("2.4GHz SPECTRUM ANALYZER");

    drawNrfIconBar();

    if (!nrfInit()) {
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setTextSize(2);
        drawCenteredText(100, "NRF24 NOT FOUND", HALEHOUND_HOTPINK, 2);
        tft.setTextSize(1);
        drawCenteredText(130, "Check wiring:", HALEHOUND_MAGENTA, 1);
        drawCenteredText(145, ("CE=GPIO" + String(NRF24_CE) + " CSN=GPIO" + String(NRF24_CSN)).c_str(), HALEHOUND_MAGENTA, 1);
        return;
    }

    waterfall_initialized = true;
    memset(current_levels, 0, sizeof(current_levels));
    memset(peak_levels, 0, sizeof(peak_levels));
    clearSkullWaterfall();

    drawAxes();
    lastSkullTime = millis();
    skullAnimFrame = 0;

    #if CYD_DEBUG
    Serial.println("[ANALYZER] NRF24 initialized successfully");
    #endif
}

void analyzerLoop() {
    // Touch uses software bit-banged SPI - no conflict with NRF24 on hardware VSPI

    if (!waterfall_initialized) {
        touchButtonsUpdate();
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty) || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
        }
        return;
    }

    touchButtonsUpdate();

    // Direct touch check - no animation delay
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            // Back icon (x=10)
            if (tx < 40) {
                exitRequested = true;
                return;
            }
            // Reset peaks icon
            if (tx >= nrfIconX[0] - 10 && tx < nrfIconX[0] + NRF_ICON_SIZE + 10) {
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                // Reset and redraw
                resetPeaks();
                tft.fillRect(GRAPH_X, GRAPH_Y, GRAPH_WIDTH, GRAPH_HEIGHT, TFT_BLACK);
                tft.fillRect(GRAPH_X, WATERFALL_Y, GRAPH_WIDTH, WATERFALL_HEIGHT, TFT_BLACK);
                drawAxes();
                return;
            }
            // Start/Stop icon
            if (tx >= nrfIconX[1] - 10) {
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                // Toggle scanning
                analyzerRunning = !analyzerRunning;
                return;
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        exitRequested = true;
        return;
    }

    scanAllChannels();

    // Bars draw every frame - smooth like scanner
    drawSpectrum();

    // Skulls draw every 100ms - saves performance
    if (millis() - lastSkullTime >= 100) {
        updateSkullWaterfall();
        drawSkullWaterfall();
        drawStatusArea();
        lastSkullTime = millis();
    }
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    analyzerRunning = false;
    exitRequested = false;
    waterfall_initialized = false;
    nrfPowerDown();
}

}  // namespace Analyzer


// ═══════════════════════════════════════════════════════════════════════════
// WLAN JAMMER - WiFi Channel Jammer
// ═══════════════════════════════════════════════════════════════════════════

namespace WLANJammer {

// WiFi channel mapping to NRF24 channels
static const uint8_t WIFI_CH_START[] = {1, 6, 11, 16, 21, 26, 31, 36, 41, 46, 51, 56, 61};
static const uint8_t WIFI_CH_END[] =   {23, 28, 33, 38, 43, 48, 53, 58, 63, 68, 73, 78, 83};
static const uint8_t WIFI_CH_CENTER[] = {12, 17, 22, 27, 32, 37, 42, 47, 52, 57, 62, 67, 72};

#define NUM_WIFI_CHANNELS 13
#define ALL_CHANNELS_MODE 0

// Display constants - INSANE EQUALIZER MODE
#define JAM_GRAPH_X 2
#define JAM_GRAPH_Y SCALE_Y(95)
#define JAM_GRAPH_WIDTH GRAPH_FULL_W
#define JAM_GRAPH_HEIGHT SCALE_Y(140)
#define JAM_NUM_BARS 85    // One bar per NRF channel (0-84 = WiFi range)

// Skull row for jammer feedback
#define JAM_SKULL_Y SCALE_Y(250)
#define JAM_SKULL_NUM 8

static volatile bool jammerActive = false;
static int currentWiFiChannel = ALL_CHANNELS_MODE;
static volatile int currentNRFChannel = 0;
static unsigned long lastDisplayTime = 0;
static bool exitRequested = false;
static bool uiInitialized = false;

static const int HOP_DELAY_US = 500;

static uint8_t signalLevels[13] = {0};
static int jamSkullFrame = 0;
static uint8_t channelHeat[JAM_NUM_BARS] = {0};  // Heat level for each NRF channel - EQUALIZER MODE!

// ═══════════════════════════════════════════════════════════════════════════
// DUAL-CORE JAMMER — FreeRTOS task on Core 0
// Same architecture as BLE Jammer & ProtoKill
// ═══════════════════════════════════════════════════════════════════════════
static TaskHandle_t wlanJamTaskHandle = NULL;
static volatile bool wlanJamTaskRunning = false;
static volatile bool wlanJamTaskDone = false;
static volatile int wlanJamChannel = ALL_CHANNELS_MODE;  // shadow of currentWiFiChannel

static void wlanJamTask(void* param) {
    // ALL SPI + NRF24 operations on core 0
    SPI.end();
    delay(2);
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    delay(5);

    if (!nrf24Radio.begin()) {
        Serial.println("[WLANJAMMER] Core 0: NRF24 begin() FAILED");
        wlanJamTaskDone = true;
        vTaskDelete(NULL);
        return;
    }

    // startConstCarrier — continuous wave, 100% duty cycle
    nrf24Radio.stopListening();
    nrf24Radio.setPALevel(RF24_PA_MAX);
    nrf24Radio.startConstCarrier(RF24_PA_MAX, 50);
    nrf24Radio.setAddressWidth(5);
    nrf24Radio.setPayloadSize(2);
    nrf24Radio.setDataRate(RF24_2MBPS);

    Serial.printf("[WLANJAMMER] Core 0: CW carrier active, isPVariant=%d\n",
                  nrf24Radio.isPVariant());

    int localHop = 1;
    int yieldCounter = 0;

    while (wlanJamTaskRunning) {
        int wifiCh = wlanJamChannel;

        localHop++;
        if (wifiCh == ALL_CHANNELS_MODE) {
            if (localHop > 83) localHop = 1;
        } else {
            if (localHop > WIFI_CH_END[wifiCh - 1] || localHop < WIFI_CH_START[wifiCh - 1]) {
                localHop = WIFI_CH_START[wifiCh - 1];
            }
        }

        nrf24Radio.setChannel(localHop);
        delayMicroseconds(HOP_DELAY_US);

        // Update shared state for display
        currentNRFChannel = localHop;

        // Feed watchdog
        yieldCounter++;
        if (yieldCounter >= 100) {
            yieldCounter = 0;
            vTaskDelay(1);
        }
    }

    // Cleanup on core 0
    nrf24Radio.stopConstCarrier();
    nrf24Radio.flush_tx();
    nrf24Radio.powerDown();
    SPI.end();

