SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
    Serial.println("[WLANJAMMER] Core 0: Radio powered down, SPI released");
    wlanJamTaskDone = true;
    vTaskDelete(NULL);
}

// Skull icons for jammer display
static const unsigned char* jamSkulls[] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};

// Icon bar for jammer - uses start/stop icon
#define JAM_ICON_NUM 3
static int jamIconX[JAM_ICON_NUM] = {SCALE_X(90), SCALE_X(170), 10};
static const unsigned char* jamIcons[JAM_ICON_NUM] = {
    bitmap_icon_start,     // Toggle ON/OFF
    bitmap_icon_RIGHT,     // Next channel
    bitmap_icon_go_back    // Back
};

static int jamActiveIcon = -1;
static int jamAnimState = 0;
static unsigned long jamLastAnim = 0;

static void drawJamIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < JAM_ICON_NUM; i++) {
        if (jamIcons[i] != NULL) {
            tft.drawBitmap(jamIconX[i], ICON_BAR_Y, jamIcons[i], 16, 16, HALEHOUND_MAGENTA);
        }
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

static int checkJamIconTouch() {
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            for (int i = 0; i < JAM_ICON_NUM; i++) {
                if (tx >= jamIconX[i] - 5 && tx <= jamIconX[i] + 21) {
                    if (jamAnimState == 0) {
                        tft.drawBitmap(jamIconX[i], ICON_BAR_Y, jamIcons[i], 16, 16, TFT_BLACK);
                        jamAnimState = 1;
                        jamActiveIcon = i;
                        jamLastAnim = millis();
                    }
                    return i;
                }
            }
        }
    }
    return -1;
}

static int processJamIconAnim() {
    if (jamAnimState > 0 && millis() - jamLastAnim >= 50) {
        if (jamAnimState == 1) {
            tft.drawBitmap(jamIconX[jamActiveIcon], ICON_BAR_Y, jamIcons[jamActiveIcon], 16, 16, HALEHOUND_MAGENTA);
            jamAnimState = 2;
            int action = jamActiveIcon;
            jamLastAnim = millis();
            return action;
        } else if (jamAnimState == 2) {
            jamAnimState = 0;
            jamActiveIcon = -1;
        }
    }
    return -1;
}

// Old raw SPI functions removed — dual-core task handles all radio ops on core 0

static void drawHeader() {
    tft.fillRect(0, CONTENT_Y_START, SCREEN_WIDTH, SCALE_Y(50), TFT_BLACK);

    drawGlitchText(SCALE_Y(55), "WLAN JAMMER", &Nosifer_Regular10pt7b);

    if (jammerActive) {
        drawGlitchStatus(SCALE_Y(72), "JAMMING", HALEHOUND_HOTPINK);
    } else {
        drawGlitchStatus(SCALE_Y(72), "STANDBY", HALEHOUND_GUNMETAL);
    }

    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, SCALE_Y(70));
    if (currentWiFiChannel == ALL_CHANNELS_MODE) {
        tft.print("Mode: ALL WiFi Channels (1-13)");
    } else {
        int freq = 2407 + (currentWiFiChannel * 5);
        tft.printf("Mode: WiFi Ch %d (%d MHz)", currentWiFiChannel, freq);
    }

    tft.drawLine(0, SCALE_Y(85), SCREEN_WIDTH, SCALE_Y(85), HALEHOUND_HOTPINK);
}

static void drawChannelDisplay() {
    int channelY = SCALE_Y(90);
    tft.fillRect(JAM_GRAPH_X, channelY, JAM_GRAPH_WIDTH, 15, TFT_BLACK);

    tft.setTextSize(1);
    for (int ch = 1; ch <= 13; ch++) {
        int x = JAM_GRAPH_X + ((ch - 1) * JAM_GRAPH_WIDTH / 13);

        if (currentWiFiChannel == ALL_CHANNELS_MODE || currentWiFiChannel == ch) {
            if (jammerActive) {
                tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
            } else {
                tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
            }
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
        }

        tft.setCursor(x + 2, channelY);
        if (ch < 10) {
            tft.printf(" %d", ch);
        } else {
            tft.printf("%d", ch);
        }
    }
}

// Forward declaration
static void drawJammerWiFiMarkers();

// Update channel heat levels - EQUALIZER MODE (85 bars!)
static void updateChannelHeat() {
    if (!jammerActive) {
        // Decay all channels when not jamming
        for (int i = 0; i < JAM_NUM_BARS; i++) {
            if (channelHeat[i] > 0) {
                channelHeat[i] = channelHeat[i] / 2;  // Fast decay when stopped
            }
        }
        return;
    }

    if (currentWiFiChannel == ALL_CHANNELS_MODE) {
        // ALL CHANNELS MODE - INSANE EQUALIZER
        // All bars dance because we're jamming EVERYTHING
        for (int i = 0; i < JAM_NUM_BARS; i++) {
            int dist = abs(i - currentNRFChannel);

            if (i == currentNRFChannel) {
                // Direct hit - MAX HEAT
                channelHeat[i] = 125;
            } else if (dist <= 6) {
                // Splash zone - strong heat with falloff
                int splash = 110 - (dist * 12);
                channelHeat[i] = (channelHeat[i] + splash) / 2;
            } else {
                // Background chaos - all bars dance randomly
                // Base 50-80 with random variation = visible activity everywhere
                int chaos = 50 + random(40);
                channelHeat[i] = (channelHeat[i] + chaos) / 2;
            }
        }
    } else {
        // SINGLE CHANNEL MODE - focused attack
        int startCh = WIFI_CH_START[currentWiFiChannel - 1];
        int endCh = WIFI_CH_END[currentWiFiChannel - 1];

        for (int i = 0; i < JAM_NUM_BARS; i++) {
            bool isTargeted = (i >= startCh && i <= endCh);
            bool isCurrentChannel = (i == currentNRFChannel);

            if (isCurrentChannel) {
                // Currently being hit - MAX HEAT
                channelHeat[i] = 125;
            } else if (isTargeted) {
                // In target range - keep warm with variation
                int baseHeat = 50 + random(30);
                int dist = abs(i - currentNRFChannel);
                int neighborBoost = (dist <= 2) ? (30 - dist * 10) : 0;
                int targetHeat = baseHeat + neighborBoost;
                channelHeat[i] = (channelHeat[i] + targetHeat) / 2;
            } else {
                // Not targeted - decay
                if (channelHeat[i] > 0) {
                    channelHeat[i] = (channelHeat[i] * 3) / 4;
                }
            }
        }
    }
}

