SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
static void drawJammerDisplay() {
    // Update heat levels first
    updateChannelHeat();

    // Clear display area
    tft.fillRect(JAM_GRAPH_X, JAM_GRAPH_Y, JAM_GRAPH_WIDTH, JAM_GRAPH_HEIGHT, TFT_BLACK);

    // Draw frame
    tft.drawRect(JAM_GRAPH_X - 1, JAM_GRAPH_Y - 1, JAM_GRAPH_WIDTH + 2, JAM_GRAPH_HEIGHT + 2, HALEHOUND_MAGENTA);

    int maxBarH = JAM_GRAPH_HEIGHT - 25;

    if (!jammerActive) {
        // Check if any heat remains (for decay animation)
        bool hasHeat = false;
        for (int i = 0; i < JAM_NUM_BARS; i++) {
            if (channelHeat[i] > 3) { hasHeat = true; break; }
        }

        if (!hasHeat) {
            // Fully stopped - show standby bars
            for (int i = 0; i < JAM_NUM_BARS; i++) {
                int x = JAM_GRAPH_X + (i * JAM_GRAPH_WIDTH / JAM_NUM_BARS);
                int barH = 8 + (i % 5) * 2;  // Slight variation
                int barY = JAM_GRAPH_Y + JAM_GRAPH_HEIGHT - barH - 10;
                tft.drawFastVLine(x, barY, barH, HALEHOUND_GUNMETAL);
                tft.drawFastVLine(x + 1, barY, barH, HALEHOUND_GUNMETAL);
            }

            // Standby text
            tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
            tft.setTextSize(1);
            tft.setCursor(JAM_GRAPH_X + 85, JAM_GRAPH_Y + 5);
            tft.print("STANDBY");

            // WiFi channel markers
            drawJammerWiFiMarkers();
            return;
        }
    }

    // DRAW THE EQUALIZER - 85 skinny bars of FIRE!
    for (int i = 0; i < JAM_NUM_BARS; i++) {
        int x = JAM_GRAPH_X + (i * JAM_GRAPH_WIDTH / JAM_NUM_BARS);
        uint8_t heat = channelHeat[i];

        // Bar height based on heat - MORE AGGRESSIVE scaling
        int barH = (heat * maxBarH) / 100;  // Taller bars!
        if (barH > maxBarH) barH = maxBarH;
        if (barH < 8) barH = 8;  // Higher minimum

        int barY = JAM_GRAPH_Y + JAM_GRAPH_HEIGHT - barH - 8;

        // Color based on heat - vibrant gradient from cyan to hot pink
        for (int y = 0; y < barH; y++) {
            float heightRatio = (float)y / (float)barH;
            float heatRatio = (float)heat / 125.0f;

            // More aggressive color gradient
            float ratio = heightRatio * (0.3f + heatRatio * 0.7f);
            if (ratio > 1.0f) ratio = 1.0f;

            // Cyan (0, 207, 255) -> Hot Pink (255, 28, 82)
            uint8_t r = (uint8_t)(ratio * 255);
            uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
            uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
            uint16_t color = tft.color565(r, g, b);

            tft.drawFastHLine(x, barY + barH - 1 - y, 2, color);
        }

        // Add glow effect at base for hot bars
        if (heat > 80) {
            tft.drawFastHLine(x, barY + barH, 2, HALEHOUND_HOTPINK);
            tft.drawFastHLine(x, barY + barH + 1, 2, tft.color565(128, 14, 41));
        }
    }

    // WiFi channel markers
    drawJammerWiFiMarkers();

    // Current frequency display
    if (jammerActive) {
        tft.fillRect(JAM_GRAPH_X + 50, JAM_GRAPH_Y + 2, 140, 12, TFT_BLACK);
        tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
        tft.setTextSize(1);
        tft.setCursor(JAM_GRAPH_X + 55, JAM_GRAPH_Y + 3);
        tft.printf(">>> %d MHz <<<", 2400 + currentNRFChannel);
    }
}

// Draw WiFi channel markers below the equalizer
static void drawJammerWiFiMarkers() {
    int markerY = JAM_GRAPH_Y + JAM_GRAPH_HEIGHT - 8;

    // Draw markers for channels 1, 6, 11, 13
    int x1 = JAM_GRAPH_X + (12 * JAM_GRAPH_WIDTH / JAM_NUM_BARS);
    int x6 = JAM_GRAPH_X + (37 * JAM_GRAPH_WIDTH / JAM_NUM_BARS);
    int x11 = JAM_GRAPH_X + (62 * JAM_GRAPH_WIDTH / JAM_NUM_BARS);
    int x13 = JAM_GRAPH_X + (72 * JAM_GRAPH_WIDTH / JAM_NUM_BARS);

    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(x1 - 2, markerY);
    tft.print("1");
    tft.setCursor(x6 - 2, markerY);
    tft.print("6");
    tft.setCursor(x11 - 4, markerY);
    tft.print("11");
    tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(x13 - 4, markerY);
    tft.print("13");
}

static void drawJammerSkulls() {
    // Skull row at bottom - visual feedback
    int skullStartX = 10;
    int skullSpacing = SCALE_X(28);

    for (int i = 0; i < JAM_SKULL_NUM; i++) {
        int x = skullStartX + (i * skullSpacing);
        tft.fillRect(x, JAM_SKULL_Y, 16, 16, TFT_BLACK);

        uint16_t color;
        if (jammerActive) {
            // Animated wave when jamming - hot pink to cyan
            int phase = (jamSkullFrame + i) % 8;
            if (phase < 4) {
                float ratio = phase / 3.0f;
                uint8_t r = (uint8_t)(ratio * 255);
                uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
                uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
                color = tft.color565(r, g, b);
            } else {
                float ratio = (phase - 4) / 3.0f;
                uint8_t r = 255 - (uint8_t)(ratio * 255);
                uint8_t g = 28 + (uint8_t)(ratio * (207 - 28));
                uint8_t b = 82 + (uint8_t)(ratio * (255 - 82));
                color = tft.color565(r, g, b);
            }
        } else {
            color = HALEHOUND_GUNMETAL;  // Gray when inactive
        }

        tft.drawBitmap(x, JAM_SKULL_Y, jamSkulls[i], 16, 16, color);
    }

    // Status text next to skulls
    tft.fillRect(skullStartX + (JAM_SKULL_NUM * skullSpacing), JAM_SKULL_Y, 50, 16, TFT_BLACK);
    tft.setTextColor(jammerActive ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(skullStartX + (JAM_SKULL_NUM * skullSpacing) + 5, JAM_SKULL_Y + 4);
    tft.print(jammerActive ? "TX!" : "OFF");

    jamSkullFrame++;
}

static void startJamming() {
    wlanJamChannel = currentWiFiChannel;
    wlanJamTaskDone = false;
    jammerActive = true;

    wlanJamTaskRunning = true;
    xTaskCreatePinnedToCore(wlanJamTask, "WLANJam", 8192, NULL, 1, &wlanJamTaskHandle, 0);

    Serial.printf("[WLANJAMMER] DUAL-CORE Started - WiFi Ch: %s, Core0 task launched\n",
                  currentWiFiChannel == ALL_CHANNELS_MODE ? "ALL" : String(currentWiFiChannel).c_str());
}

static void stopJamming() {
    wlanJamTaskRunning = false;

