SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
    if (wlanJamTaskHandle) {
        unsigned long waitStart = millis();
        while (!wlanJamTaskDone && (millis() - waitStart < 500)) {
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        wlanJamTaskHandle = NULL;
    }

    jammerActive = false;
    Serial.println("[WLANJAMMER] Stopped — core 0 task terminated");
}

void wlanjammerSetup() {
    exitRequested = false;
    jammerActive = false;
    currentWiFiChannel = ALL_CHANNELS_MODE;
    currentNRFChannel = 0;
    jamAnimState = 0;
    jamActiveIcon = -1;
    jamSkullFrame = 0;
    memset(channelHeat, 0, sizeof(channelHeat));

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    drawJamIconBar();

    // Quick check that NRF24 is present (jam task does full init on core 0)
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    nrf24Radio.begin();
    if (!nrf24Radio.isChipConnected()) {
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setTextSize(2);
        drawCenteredText(100, "NRF24 NOT FOUND", HALEHOUND_HOTPINK, 2);
        tft.setTextSize(1);
        drawCenteredText(130, "Check wiring:", HALEHOUND_MAGENTA, 1);
        drawCenteredText(145, ("CE=GPIO" + String(NRF24_CE) + " CSN=GPIO" + String(NRF24_CSN)).c_str(), HALEHOUND_MAGENTA, 1);
        uiInitialized = false;
        return;
    }

    memset(signalLevels, 0, sizeof(signalLevels));

    drawHeader();
    drawChannelDisplay();
    drawJammerDisplay();
    drawJammerSkulls();

    lastDisplayTime = millis();
    uiInitialized = true;

    #if CYD_DEBUG
    Serial.println("[WLANJAMMER] NRF24 initialized successfully");
    #endif
}

void wlanjammerLoop() {
    if (!uiInitialized) {
        touchButtonsUpdate();
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty) || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
        }
        return;
    }

    touchButtonsUpdate();

    // Direct touch check with touch release handling
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            // Back icon (x=10)
            if (tx < 40) {
                if (jammerActive) stopJamming();
                exitRequested = true;
                return;
            }
            // Toggle icon
            if (tx >= jamIconX[0] - 10 && tx < jamIconX[0] + 30) {
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                if (jammerActive) stopJamming(); else startJamming();
                drawHeader();
                drawChannelDisplay();
                return;
            }
            // Next channel icon
            if (tx >= jamIconX[1] - 10 && tx < jamIconX[1] + 30) {
                // Wait for touch release
                waitForTouchRelease();
                delay(200);
                currentWiFiChannel++;
                if (currentWiFiChannel > 13) currentWiFiChannel = ALL_CHANNELS_MODE;
                wlanJamChannel = currentWiFiChannel;  // sync to jam task
                drawHeader();
                drawChannelDisplay();
                return;
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (jammerActive) stopJamming();
        exitRequested = true;
        return;
    }

    // ═══════════════════════════════════════════════════════════════════════
    // JAMMING ENGINE RUNS ON CORE 0 — display runs here on core 1
    // Full equalizer + skulls at full speed, zero impact on jamming
    // ═══════════════════════════════════════════════════════════════════════

    // Update display
    if (millis() - lastDisplayTime >= 80) {
        drawJammerDisplay();
        drawJammerSkulls();
        lastDisplayTime = millis();
    }
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    if (jammerActive || wlanJamTaskRunning) {
        stopJamming();
    }
    exitRequested = false;
    uiInitialized = false;
}

}  // namespace WLANJammer


// ═══════════════════════════════════════════════════════════════════════════
// PROTO KILL - Multi-Protocol Jammer
// ═══════════════════════════════════════════════════════════════════════════

namespace ProtoKill {

enum OperationMode {
    BLE_MODULE,
    Bluetooth_MODULE,
    WiFi_MODULE,
    VIDEO_TX_MODULE,
    RC_MODULE,
    USB_WIRELESS_MODULE,
    ZIGBEE_MODULE,
    NRF24_MODULE
};

static OperationMode currentMode = WiFi_MODULE;
static volatile bool jammerActive = false;
static bool exitRequested = false;
static bool uiInitialized = false;

// Channel arrays for different protocols
static const byte bluetooth_channels[] = {32, 34, 46, 48, 50, 52, 0, 1, 2, 4, 6, 8, 22, 24, 26, 28, 30, 74, 76, 78, 80};
static const byte ble_channels[] = {2, 26, 80};
static const byte WiFi_channels[] = {
    2, 7, 12, 17, 22,     // WiFi Ch 1 (2412MHz ±11MHz)
    27, 32, 37, 42, 47,   // WiFi Ch 6 (2437MHz ±11MHz)
    52, 57, 62, 67, 72    // WiFi Ch 11 (2462MHz ±11MHz)
};
static const byte usbWireless_channels[] = {40, 50, 60};
static const byte videoTransmitter_channels[] = {70, 75, 80};
static const byte rc_channels[] = {10, 30, 50, 70};
static const byte zigbee_channels[] = {5, 25, 50, 75};
static const byte nrf24_channels[] = {76, 78, 79};

// ═══════════════════════════════════════════════════════════════════════════
// ADAPTIVE DWELL — same pattern as BLE Jammer
// Target ~1.5ms sweep regardless of channel count
// ═══════════════════════════════════════════════════════════════════════════
struct PkJamMode {
    const byte* channels;
    int count;
    int dwellUs;
};
static const PkJamMode pkModes[] = {
    {ble_channels,              3, 500},   //  3ch × 500us = 1.50ms
    {bluetooth_channels,       21,  71},   // 21ch ×  71us = 1.49ms
    {WiFi_channels,            15, 100},   // 15ch × 100us = 1.50ms
    {videoTransmitter_channels, 3, 500},   //  3ch × 500us = 1.50ms
    {rc_channels,               4, 375},   //  4ch × 375us = 1.50ms
    {usbWireless_channels,      3, 500},   //  3ch × 500us = 1.50ms
    {zigbee_channels,           4, 375},   //  4ch × 375us = 1.50ms
    {nrf24_channels,            3, 500}    //  3ch × 500us = 1.50ms
};

// Forward declaration (defined later in UI section)
static const char* getModeString(OperationMode mode);

// Shared state — written by jam task on core 0, read by display on core 1
static volatile int pkCurrentChannel = 0;
static volatile int pkHitCount = 0;

// ═══════════════════════════════════════════════════════════════════════════
// DUAL-CORE JAMMER — FreeRTOS task on Core 0
// Same architecture as BLE Jammer: NRF24 on VSPI (core 0), display on HSPI (core 1)
// ═══════════════════════════════════════════════════════════════════════════
static TaskHandle_t pkJamTaskHandle = NULL;
static volatile bool pkJamTaskRunning = false;
static volatile bool pkJamTaskDone = false;
static volatile int pkJamModeIndex = 2;  // shadow of currentMode for jam task

