SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
static void pkJamTask(void* param) {
    // ALL SPI + NRF24 operations on core 0
    SPI.end();
    delay(2);
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    delay(5);

    if (!nrf24Radio.begin()) {
        Serial.println("[PROTOKILL] Core 0: NRF24 begin() FAILED");
        pkJamTaskDone = true;
        vTaskDelete(NULL);
        return;
    }

    // startConstCarrier — continuous wave, 100% duty cycle
    nrf24Radio.stopListening();
    nrf24Radio.setPALevel(RF24_PA_MAX);
    nrf24Radio.startConstCarrier(RF24_PA_MAX, 50);
    nrf24Radio.setAddressWidth(5);
    nrf24Radio.setPayloadSize(2);
    nrf24Radio.setDataRate(RF24_2MBPS);

    Serial.printf("[PROTOKILL] Core 0: CW carrier active, isPVariant=%d\n",
                  nrf24Radio.isPVariant());

    int localHop = 0;
    int yieldCounter = 0;

    while (pkJamTaskRunning) {
        int modeIdx = pkJamModeIndex;
        const PkJamMode& m = pkModes[modeIdx];

        localHop++;
        if (localHop >= m.count) localHop = 0;

        uint8_t ch = m.channels[localHop];
        nrf24Radio.setChannel(ch);
        delayMicroseconds(m.dwellUs);

        // Update shared state for display
        pkCurrentChannel = ch;
        pkHitCount++;

        // Feed watchdog
        yieldCounter++;
        if (yieldCounter >= 100) {
            yieldCounter = 0;
            vTaskDelay(1);
        }
    }

    // Cleanup on core 0
    nrf24Radio.stopConstCarrier();
    nrf24Radio.flush_tx();
    nrf24Radio.powerDown();
    SPI.end();

    Serial.println("[PROTOKILL] Core 0: Radio powered down, SPI released");
    pkJamTaskDone = true;
    vTaskDelete(NULL);
}

static void pkStartJamming() {
    pkHitCount = 0;
    pkJamModeIndex = (int)currentMode;
    pkJamTaskDone = false;
    jammerActive = true;

    pkJamTaskRunning = true;
    xTaskCreatePinnedToCore(pkJamTask, "ProtoKill", 8192, NULL, 1, &pkJamTaskHandle, 0);

    Serial.printf("[PROTOKILL] DUAL-CORE Started - Mode: %s, Core0 task launched\n",
                  getModeString(currentMode));
}

static void pkStopJamming() {
    pkJamTaskRunning = false;

    if (pkJamTaskHandle) {
        unsigned long waitStart = millis();
        while (!pkJamTaskDone && (millis() - waitStart < 500)) {
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        pkJamTaskHandle = NULL;
    }

    jammerActive = false;
    Serial.println("[PROTOKILL] Stopped — core 0 task terminated");
}

#define PK_LINE_HEIGHT 12
#define PK_MAX_LINES 15

static String pkBuffer[PK_MAX_LINES];
static uint16_t pkBufferColor[PK_MAX_LINES];
static int pkIndex = 0;

// Icon bar for proto kill
#define PK_ICON_NUM 4
static int pkIconX[PK_ICON_NUM] = {SCALE_X(50), SCALE_X(130), SCALE_X(170), 10};
static const unsigned char* pkIcons[PK_ICON_NUM] = {
    bitmap_icon_start,     // Toggle ON/OFF
    bitmap_icon_RIGHT,     // Mode +
    bitmap_icon_LEFT,      // Mode -
    bitmap_icon_go_back    // Back
};

static int pkActiveIcon = -1;
static int pkAnimState = 0;
static unsigned long pkLastAnim = 0;

static void drawPkIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < PK_ICON_NUM; i++) {
        if (pkIcons[i] != NULL) {
            tft.drawBitmap(pkIconX[i], ICON_BAR_Y, pkIcons[i], 16, 16, HALEHOUND_MAGENTA);
        }
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

static int checkPkIconTouch() {
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            for (int i = 0; i < PK_ICON_NUM; i++) {
                if (tx >= pkIconX[i] - 5 && tx <= pkIconX[i] + 21) {
                    if (pkAnimState == 0) {
                        tft.drawBitmap(pkIconX[i], ICON_BAR_Y, pkIcons[i], 16, 16, TFT_BLACK);
                        pkAnimState = 1;
                        pkActiveIcon = i;
                        pkLastAnim = millis();
                    }
                    return i;
                }
            }
        }
    }
    return -1;
}

static int processPkIconAnim() {
    if (pkAnimState > 0 && millis() - pkLastAnim >= 50) {
        if (pkAnimState == 1) {
            tft.drawBitmap(pkIconX[pkActiveIcon], ICON_BAR_Y, pkIcons[pkActiveIcon], 16, 16, HALEHOUND_MAGENTA);
            pkAnimState = 2;
            int action = pkActiveIcon;
            pkLastAnim = millis();
            return action;
        } else if (pkAnimState == 2) {
            pkAnimState = 0;
            pkActiveIcon = -1;
        }
    }
    return -1;
}

// ═══════════════════════════════════════════════════════════════════════════
// PROTO KILL - Complete UI Redesign
// 85-bar equalizer, big protocol display, no diagnostic log clutter
// ═══════════════════════════════════════════════════════════════════════════

static const char* getModeString(OperationMode mode) {
    switch (mode) {
        case BLE_MODULE:          return "BLE";
        case Bluetooth_MODULE:    return "BLUETOOTH";
        case WiFi_MODULE:         return "WIFI";
        case USB_WIRELESS_MODULE: return "USB";
        case VIDEO_TX_MODULE:     return "VIDEO TX";
        case RC_MODULE:           return "RC";
        case ZIGBEE_MODULE:       return "ZIGBEE";
        case NRF24_MODULE:        return "NRF24";
        default:                  return "UNKNOWN";
    }
}

// Old raw SPI functions removed — dual-core task handles all radio ops on core 0

// ═══════════════════════════════════════════════════════════════════════════
// EQUALIZER SYSTEM - 85 bars like WLAN Jammer
// ═══════════════════════════════════════════════════════════════════════════

#define PK_NUM_BARS      85
#define PK_GRAPH_X       5
#define PK_GRAPH_Y       SCALE_Y(160)
#define PK_GRAPH_WIDTH   GRAPH_PADDED_W
#define PK_GRAPH_HEIGHT  (SCREEN_HEIGHT - PK_GRAPH_Y - 5)

static uint8_t pkChannelHeat[PK_NUM_BARS] = {0};
static unsigned long pkLastUpdate = 0;

