SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
// Get channel array and size for current protocol
static void getProtocolChannels(OperationMode mode, const byte** channels, int* numChannels) {
    switch (mode) {
        case BLE_MODULE:
            *channels = ble_channels;
            *numChannels = sizeof(ble_channels);
            break;
        case Bluetooth_MODULE:
            *channels = bluetooth_channels;
            *numChannels = sizeof(bluetooth_channels);
            break;
        case WiFi_MODULE:
            *channels = WiFi_channels;
            *numChannels = sizeof(WiFi_channels);
            break;
        case USB_WIRELESS_MODULE:
            *channels = usbWireless_channels;
            *numChannels = sizeof(usbWireless_channels);
            break;
        case VIDEO_TX_MODULE:
            *channels = videoTransmitter_channels;
            *numChannels = sizeof(videoTransmitter_channels);
            break;
        case RC_MODULE:
            *channels = rc_channels;
            *numChannels = sizeof(rc_channels);
            break;
        case ZIGBEE_MODULE:
            *channels = zigbee_channels;
            *numChannels = sizeof(zigbee_channels);
            break;
        case NRF24_MODULE:
            *channels = nrf24_channels;
            *numChannels = sizeof(nrf24_channels);
            break;
        default:
            *channels = WiFi_channels;
            *numChannels = sizeof(WiFi_channels);
    }
}

// Update heat levels for equalizer
static void updatePkHeat() {
    if (!jammerActive) {
        // Decay when not jamming
        for (int i = 0; i < PK_NUM_BARS; i++) {
            if (pkChannelHeat[i] > 0) {
                pkChannelHeat[i] = pkChannelHeat[i] / 2;
            }
        }
        return;
    }

    // Get channels for current protocol
    const byte* channels;
    int numChannels;
    getProtocolChannels(currentMode, &channels, &numChannels);

    // All protocol channels get activity
    for (int i = 0; i < PK_NUM_BARS; i++) {
        int dist = abs(i - pkCurrentChannel);

        if (i == pkCurrentChannel) {
            // Direct hit - MAX HEAT
            pkChannelHeat[i] = 125;
        } else if (dist <= 5) {
            // Splash zone
            int splash = 100 - (dist * 15);
            pkChannelHeat[i] = (pkChannelHeat[i] + splash) / 2;
        } else {
            // Check if this bar is near any protocol channel
            bool nearTarget = false;
            for (int c = 0; c < numChannels; c++) {
                if (abs(i - channels[c]) <= 3) {
                    nearTarget = true;
                    break;
                }
            }
            if (nearTarget) {
                // Background activity on protocol channels
                int chaos = 40 + random(30);
                pkChannelHeat[i] = (pkChannelHeat[i] + chaos) / 2;
            } else {
                // Decay non-target areas
                if (pkChannelHeat[i] > 0) {
                    pkChannelHeat[i] = (pkChannelHeat[i] * 3) / 4;
                }
            }
        }
    }
}

// Draw protocol channel markers at bottom of equalizer
static void drawPkChannelMarkers() {
    const byte* channels;
    int numChannels;
    getProtocolChannels(currentMode, &channels, &numChannels);

    int markerY = PK_GRAPH_Y + PK_GRAPH_HEIGHT - 8;

    for (int c = 0; c < numChannels; c++) {
        int x = PK_GRAPH_X + (channels[c] * PK_GRAPH_WIDTH / PK_NUM_BARS);
        tft.drawFastVLine(x, markerY, 6, HALEHOUND_MAGENTA);
        tft.drawFastVLine(x + 1, markerY, 6, HALEHOUND_MAGENTA);
    }
}

// Draw the full equalizer display
static void drawPkEqualizer() {
    updatePkHeat();

    // Clear display area
    tft.fillRect(PK_GRAPH_X, PK_GRAPH_Y, PK_GRAPH_WIDTH, PK_GRAPH_HEIGHT, TFT_BLACK);

    // Draw frame
    tft.drawRect(PK_GRAPH_X - 1, PK_GRAPH_Y - 1, PK_GRAPH_WIDTH + 2, PK_GRAPH_HEIGHT + 2, HALEHOUND_MAGENTA);

    int maxBarH = PK_GRAPH_HEIGHT - 20;

    if (!jammerActive) {
        // Check for remaining heat (decay animation)
        bool hasHeat = false;
        for (int i = 0; i < PK_NUM_BARS; i++) {
            if (pkChannelHeat[i] > 3) { hasHeat = true; break; }
        }

        if (!hasHeat) {
            // Standby - show idle bars
            for (int i = 0; i < PK_NUM_BARS; i++) {
                int x = PK_GRAPH_X + (i * PK_GRAPH_WIDTH / PK_NUM_BARS);
                int barH = 6 + (i % 4) * 2;
                int barY = PK_GRAPH_Y + PK_GRAPH_HEIGHT - barH - 12;
                tft.drawFastVLine(x, barY, barH, HALEHOUND_GUNMETAL);
                tft.drawFastVLine(x + 1, barY, barH, HALEHOUND_GUNMETAL);
            }

            // Standby text
            tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
            tft.setTextSize(2);
            tft.setCursor(PK_GRAPH_X + 65, PK_GRAPH_Y + 50);
            tft.print("STANDBY");
            tft.setTextSize(1);

            drawPkChannelMarkers();
            return;
        }
    }

    // DRAW THE EQUALIZER - 85 bars of FIRE!
    for (int i = 0; i < PK_NUM_BARS; i++) {
        int x = PK_GRAPH_X + (i * PK_GRAPH_WIDTH / PK_NUM_BARS);
        uint8_t heat = pkChannelHeat[i];

        // Bar height based on heat
        int barH = (heat * maxBarH) / 100;
        if (barH > maxBarH) barH = maxBarH;
        if (barH < 6) barH = 6;

        int barY = PK_GRAPH_Y + PK_GRAPH_HEIGHT - barH - 12;

        // Color gradient from cyan to hot pink
        for (int y = 0; y < barH; y++) {
            float heightRatio = (float)y / (float)barH;
            float heatRatio = (float)heat / 125.0f;
            float ratio = heightRatio * (0.3f + heatRatio * 0.7f);
            if (ratio > 1.0f) ratio = 1.0f;

            // Cyan -> Hot Pink gradient
            uint8_t r = (uint8_t)(ratio * 255);
            uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
            uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
            uint16_t color = tft.color565(r, g, b);

            tft.drawFastHLine(x, barY + barH - 1 - y, 2, color);
        }

        // Glow at base for hot bars
        if (heat > 80) {
            tft.drawFastHLine(x, barY + barH, 2, HALEHOUND_HOTPINK);
            tft.drawFastHLine(x, barY + barH + 1, 2, tft.color565(128, 14, 41));
        }
    }

    // Channel markers
    drawPkChannelMarkers();
}

// ═══════════════════════════════════════════════════════════════════════════
// MAIN UI DRAWING - FreeMonoBold fonts for terminal/hacker look
// ═══════════════════════════════════════════════════════════════════════════

// Helper to draw centered FreeFont text
static void pkDrawFreeFont(int y, const char* text, uint16_t color, const GFXfont* font) {
    tft.setFreeFont(font);
    tft.setTextColor(color, TFT_BLACK);

