SLZLabs/HaleHound-CYD-3.2-ESP32E-40R/nrf24_attacks.cpp
    // Calculate width for centering using textWidth()
    int w = tft.textWidth(text);
    int x = (SCREEN_WIDTH - w) / 2;
    if (x < 0) x = 0;

    tft.setCursor(x, y);
    tft.print(text);

    // Reset to default font
    tft.setFreeFont(NULL);
}

static void drawPkMainUI() {
    // Clear main area
    tft.fillRect(0, CONTENT_Y_START, SCREEN_WIDTH, SCALE_Y(122), TFT_BLACK);

    // Title line
    tft.drawLine(0, CONTENT_Y_START, SCREEN_WIDTH, CONTENT_Y_START, HALEHOUND_HOTPINK);
    tft.setFreeFont(NULL);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(SCALE_X(75), SCALE_Y(45));
    tft.print("PROTO KILL");
    tft.drawLine(0, SCALE_Y(56), SCREEN_WIDTH, SCALE_Y(56), HALEHOUND_HOTPINK);

    // Rounded frame for main content
    tft.drawRoundRect(10, SCALE_Y(60), CONTENT_INNER_W, SCALE_Y(70), 8, HALEHOUND_VIOLET);
    tft.drawRoundRect(11, SCALE_Y(61), CONTENT_INNER_W - 2, SCALE_Y(68), 7, HALEHOUND_GUNMETAL);

    // Protocol Name - Nosifer18pt with glitch effect
    tft.fillRect(15, SCALE_Y(65), CONTENT_INNER_W - 10, SCALE_Y(30), TFT_BLACK);
    drawGlitchTitle(SCALE_Y(90), getModeString(currentMode));

    // Status - Nosifer12pt
    tft.fillRect(15, SCALE_Y(100), CONTENT_INNER_W - 10, SCALE_Y(25), TFT_BLACK);
    if (jammerActive) {
        drawGlitchStatus(SCALE_Y(120), "JAMMING", HALEHOUND_HOTPINK);
    } else {
        drawGlitchStatus(SCALE_Y(120), "STANDBY", HALEHOUND_GUNMETAL);
    }

    // Stats line - default font
    tft.setFreeFont(NULL);
    tft.fillRect(0, SCALE_Y(135), SCREEN_WIDTH, 20, TFT_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(SCALE_X(35), SCALE_Y(140));
    tft.printf("CH: %03d", pkCurrentChannel);
    tft.setCursor(SCALE_X(130), SCALE_Y(140));
    tft.printf("HITS: %d", pkHitCount);

    // Separator before equalizer
    tft.drawLine(0, SCALE_Y(155), SCREEN_WIDTH, SCALE_Y(155), HALEHOUND_HOTPINK);
}

static void updatePkStats() {
    // Only update stats line (fast partial update)
    tft.setFreeFont(NULL);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);

    // Channel
    tft.fillRect(SCALE_X(35), SCALE_Y(140), SCALE_W(70), 10, TFT_BLACK);
    tft.setCursor(SCALE_X(35), SCALE_Y(140));
    tft.printf("CH: %03d", pkCurrentChannel);

    // Hits
    tft.fillRect(SCALE_X(130), SCALE_Y(140), SCALE_W(100), 10, TFT_BLACK);
    tft.setCursor(SCALE_X(130), SCALE_Y(140));
    tft.printf("HITS: %d", pkHitCount);
}

static void updatePkStatus() {
    // Clear inside the frame and redraw
    tft.fillRect(15, SCALE_Y(65), CONTENT_INNER_W - 10, SCALE_Y(60), TFT_BLACK);

    // Protocol Name
    drawGlitchTitle(SCALE_Y(90), getModeString(currentMode));

    // Status
    if (jammerActive) {
        drawGlitchStatus(SCALE_Y(120), "JAMMING", HALEHOUND_HOTPINK);
    } else {
        drawGlitchStatus(SCALE_Y(120), "STANDBY", HALEHOUND_GUNMETAL);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP AND LOOP
// ═══════════════════════════════════════════════════════════════════════════

void prokillSetup() {
    exitRequested = false;
    jammerActive = false;
    currentMode = WiFi_MODULE;
    pkHitCount = 0;
    pkCurrentChannel = 0;

    // Clear heat
    for (int i = 0; i < PK_NUM_BARS; i++) {
        pkChannelHeat[i] = 0;
    }

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    drawPkIconBar();

    // Quick check that NRF24 is present (jam task does full init on core 0)
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    nrf24Radio.begin();
    if (!nrf24Radio.isChipConnected()) {
        tft.setTextSize(2);
        drawCenteredText(100, "NRF24 NOT FOUND", HALEHOUND_HOTPINK, 2);
        tft.setTextSize(1);
        drawCenteredText(130, "Check wiring:", HALEHOUND_MAGENTA, 1);
        drawCenteredText(145, ("CE=GPIO" + String(NRF24_CE) + " CSN=GPIO" + String(NRF24_CSN)).c_str(), HALEHOUND_MAGENTA, 1);
        uiInitialized = false;
        return;
    }

    drawPkMainUI();
    drawPkEqualizer();

    uiInitialized = true;

    #if CYD_DEBUG
    Serial.println("[PROTOKILL] NRF24 initialized successfully");
    #endif
}

void prokillLoop() {
    if (!uiInitialized) {
        touchButtonsUpdate();
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty) || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
        }
        return;
    }

    touchButtonsUpdate();

    // Touch handling
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        if (ty >= ICON_BAR_TOUCH_TOP && ty <= ICON_BAR_TOUCH_BOTTOM) {
            // Back icon (x=10)
            if (tx < 40) {
                if (jammerActive) pkStopJamming();
                exitRequested = true;
                return;
            }
            // Toggle icon (x=50)
            if (tx >= 40 && tx < 100) {
                if (jammerActive) {
                    pkStopJamming();
                } else {
                    pkStartJamming();
                }
                updatePkStatus();
                waitForTouchRelease();
            }
            // Mode + icon (x=130)
            if (tx >= 100 && tx < 170) {
                currentMode = static_cast<OperationMode>((currentMode + 1) % 8);
                pkJamModeIndex = (int)currentMode;  // sync to jam task
                updatePkStatus();
                waitForTouchRelease();
            }
            // Mode - icon (x=170)
            if (tx >= 170) {
                currentMode = static_cast<OperationMode>((currentMode == 0) ? 7 : (currentMode - 1));
                pkJamModeIndex = (int)currentMode;  // sync to jam task
                updatePkStatus();
                waitForTouchRelease();
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (jammerActive) pkStopJamming();
        exitRequested = true;
        return;
    }

    // ═══════════════════════════════════════════════════════════════════════
    // JAMMING ENGINE RUNS ON CORE 0 — display runs here on core 1
    // Full equalizer + stats at full speed, zero impact on jamming
    // ═══════════════════════════════════════════════════════════════════════
    unsigned long displayInterval = jammerActive ? 80 : 30;
    if (millis() - pkLastUpdate >= displayInterval) {
        pkLastUpdate = millis();
        updatePkStats();
        drawPkEqualizer();
    }
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    if (jammerActive || pkJamTaskRunning) {
        pkStopJamming();
    }
    exitRequested = false;
    uiInitialized = false;
}

}  // namespace ProtoKill
